01 LIMITS-RECORD.
   05  NAME            PIC X(16).
   05  ADDRESS-LINE    PIC X(22).
   05  POSTCODE        PIC XXXXXXXXX.
   05  PHONE-NUMBER    PIC 9(14).
   05  CREDIT-LIMIT    PIC 9(13).
   05  DATE-OF-BIRTH   PIC 99999999.